app/services/ai_summary_service.rb

  def summarize(command:, context_items:, entities: {})
    payload = openai_enabled? ? openai_summary(command, context_items, entities) : deterministic_summary(command, context_items, entities)

    command.create_ai_summary!(
      summary: payload.fetch(:summary),
      action_items: payload.fetch(:action_items),
      suggested_response: payload[:suggested_response],
      confidence_score: payload.fetch(:confidence_score, 0.75)
    )
---
INSERT INTO "ai_summaries" ("command_id", "summary", "action_items", "suggested_response", "confidence_score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"