app/services/command_processor.rb

UPDATE "commands" SET "intent" = $1, "status" = $2, "started_at" = $3, "updated_at" = $4 WHERE "commands"."id" = $5  [["intent", "person_update"], ["status", "processing"], ["started_at", "2026-06-17 16:35:38.451862"], ["updated_at", "2026-06-17 16:35:38.452091"], ["id", 1]]
---
  def process(command)
    detected = intent_detector.detect(command.raw_text)

    command.update!(
      intent: detected.name,
      status: "processing",
      started_at: Time.current,
      error_message: nil
    )