app/services/context_collector.rb

  def persist_context_item(command, item)
    command.context_items.create!(
      source: item.fetch(:source),
      external_id: item[:external_id],
      title: item.fetch(:title),
      body: item[:body],
      metadata: item[:metadata] || {},
      occurred_at: item[:occurred_at]
    )
---
INSERT INTO "context_items" ("command_id", "source", "external_id", "title", "body", "metadata", "occurred_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"