app/controllers/api/v1/base_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
---
      def current_user
        @current_user ||= User.find_or_create_by!(email: "demo@example.com") do |user|