app/controllers/api/v1/commands_controller.rb

INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "[FILTERED]"], ["name", "Demo User"], ["created_at", "2026-06-17 16:35:47.104752"], ["updated_at", "2026-06-17 16:35:47.104752"]]
INSERT INTO "commands" ("user_id", "raw_text", "intent", "status", "response", "error_message", "started_at", "completed_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
      def create
        command = current_user.commands.create!(raw_text: command_params.fetch(:command))

SELECT "ai_summaries".* FROM "ai_summaries" WHERE "ai_summaries"."command_id" = $1  [["command_id", 2]]
SELECT "commands".* FROM "commands" WHERE "commands"."user_id" = $1 AND "commands"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
SELECT "context_items".* FROM "context_items" WHERE "context_items"."command_id" = $1  [["command_id", 2]]
SELECT "context_items".* FROM "context_items" WHERE "context_items"."command_id" = $1 ORDER BY "context_items"."occurred_at" DESC  [["command_id", 2]]
---
      def show
        command = current_user.commands.includes(:context_items, :ai_summary).find(params[:id])

        render json: {
          id: command.id,
          status: command.status,
          intent: command.intent,
          command: command.raw_text,
          response: command.response_payload,
          context: command.context_items.order(occurred_at: :desc).map { |item| context_payload(item) },
          ai_summary: ai_summary_payload(command.ai_summary),
          suggested_actions: command.ai_summary&.action_items || [],
          error_message: command.error_message